#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого СтрокаТч из Выплаты Цикл 
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = СтрокаТч.Сотрудник;
		Движение.Сумма = СтрокаТч.Сумма; 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Регистратор = Ссылка; 
   
	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
			
	Выплаты.Очистить();
	Сообщить("Выплаты успешно начислены");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ВыполнитьАвтозаполнение() Экспорт 
   	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	
	Запрос.УстановитьПараметр("Период",Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Выплаты.Очистить();
	
	ТаблицаЗначенийЗаполнения = Новый ТаблицаЗначений;
	ТаблицаЗначенийЗаполнения.Колонки.Добавить("Сотрудник");
	ТаблицаЗначенийЗаполнения.Колонки.Добавить("Сумма");
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСторка = ТаблицаЗначенийЗаполнения.Добавить();
		НоваяСторка.Сотрудник = Выборка.Сотрудник;
		НоваяСторка.Сумма = Выборка.СуммаОстаток;  
		
	КонецЦикла; 
	
	ЭтотОбъект.Дата = ТекущаяДата();
    Возврат ТаблицаЗначенийЗаполнения;  
	
КонецФункции
               
#КонецОбласти

#КонецЕсли

