Функция ПровестиМассивДокументовСервер(Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Наименование КАК Наименование,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало КАК ВКМ_ПериодДействияНачало,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец КАК ВКМ_ПериодДействияКонец,
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДоговорыАбонОбс
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало = &ВКМ_ПериодДействияНачало
		|	И ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец = &ВКМ_ПериодДействияКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыАбонОбс.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	ДоговорыАбонОбс.ВКМ_ПериодДействияНачало КАК ДатаНачала,
		|	ДоговорыАбонОбс.ВКМ_ПериодДействияКонец КАК ДатаКонца
		|ИЗ
		|	ДоговорыАбонОбс КАК ДоговорыАбонОбс
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыАбонОбс.Ссылка = РеализацияТоваровУслуг.Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ВКМ_ПериодДействияКонец", КонецМесяца(Период)-86399);
	Запрос.УстановитьПараметр("ВКМ_ПериодДействияНачало", НачалоМесяца(Период));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	МассивВозврата = Новый Массив;
    
	
	//Объект.СписокРеализаций.Очистить();
	Пока Выборка.Следующий() Цикл
		//Если есть договор,но нет реализации
		Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда
			//Создадим документ реализации	
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Контрагент = Выборка.Договор.Владелец;
			НовыйДокумент.Организация = Выборка.Договор.Организация;
			НовыйДокумент.Договор = Выборка.Договор.Ссылка;
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.Дата = ТекущаяДата();   
			НовыйДокумент.ВыполнитьАвтозаполнение(); 
			АнализЗаполнения = НовыйДокумент.ПроверитьЗаполнение();  
			Если АнализЗаполнения = Ложь Тогда
				Сообщить("Не заполнено основание"); 
				Продолжить;
			Иначе
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				МассивВозврата.Добавить(НовыйДокумент.Ссылка);
			КонецЕсли;
			
		ИНАЧЕ
			
			Продолжить; 
			
		КонецЕсли;
		
		
	КонецЦикла;
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(МассивВозврата,Новый УникальныйИдентификатор);
	Возврат МассивВозврата;
	
КонецФункции