
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Диаграмма.Очистить();
	ДанныеТч = ПолучитьИзВременногоХранилища(ЭтаФорма.Параметры.АдресДанных);
	
	Для Каждого СтрокаТч из ДанныеТч Цикл
		
		Точка = Диаграмма.УстановитьТочку(СтрокаТч.Сотрудник); 
		Серия = Диаграмма.УстановитьСерию(СтрокаТч.РазностьДат);
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия); 
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТч.ДатаНачала;
		Интервал.Конец = СтрокаТч.ДатаОкончания; 
		
	КонецЦикла;
	
КонецПроцедуры
