#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	
	РассчитатьДополнительныеНачисления(); 
	
	ДвиженияВзаиморасчетыССотрудниками();

КонецПроцедуры    

Процедура СформироватьДвижения()  
	
	Для каждого СтрокаТЧ из СписокСотрудников Цикл
					
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = СтрокаТЧ.ВидРасчёта;
		Движение.Сотрудник = СтрокаТЧ.Сотрудник;
		Движение.Размер = СтрокаТЧ.СуммаПремии;
	
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьДополнительныеНачисления()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Размер КАК Размер
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
		|	И ВКМ_ДополнительныеНачисления.ВидРасчета = &ВидРасчета";

	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Движение = Движения.ВКМ_ДополнительныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Результат = (Движение.Размер - (Движение.Размер / 100 * 13));
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать(,Истина);
КонецПроцедуры

Процедура ДвиженияВзаиморасчетыССотрудниками()
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Результат КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	МЕСЯЦ(ВКМ_ДополнительныеНачисления.ПериодРегистрации) = МЕСЯЦ(&ПериодРегистрации)
		|	И ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", Дата);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Результат; 
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Регистратор = Ссылка;
	КонецЦикла;
	

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли