
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ВКМ_АктОбОказанныхУслугах)
	ТабДок = Новый ТабличныйДокумент;
	ВКМ_АктОбОказанныхУслугах(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ВКМ_АктОбОказанныхУслугах(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваровУслуг.ВКМ_АктОбОказанныхУслугах(ТабДок, ПараметрКоманды);
КонецПроцедуры
